{
  "backend/main.mo": "Motoko canister implementing user profiles with authorization checks and a full application workflow including creation, status management, and admin‑restricted updates.",
  "feature_evidence.json": "Feature evidence report mapping two admin UI wording and navigation updates to affected frontend files and components.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of all frontend files for reference or documentation.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend styles.",
  "frontend/index.html": "Base HTML file bootstrapping the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for public and admin pages with layout and admin guards.",
  "frontend/src/components/admin/ApplicationDetail.tsx": "Detailed admin view for a single application with status actions, processing fee controls, and payment method assignment.",
  "frontend/src/components/admin/ApplicationTable.tsx": "Searchable admin table listing all applications and allowing selection for detail view.",
  "frontend/src/components/admin/ReceivingAccountForm.tsx": "Form for creating or editing bank or crypto receiving accounts with parsed and reconstructed account detail fields.",
  "frontend/src/components/auth/AdminGuard.tsx": "Protects admin-only routes by checking identity and admin status, showing login prompts or redirecting unauthorized users.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity with automatic session clearing and retry handling.",
  "frontend/src/components/layout/AppLayout.tsx": "Wraps the app with a header, footer, and main content container.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders a simple footer with attribution and a link to caffeine.ai.",
  "frontend/src/components/layout/SiteHeader.tsx": "Displays the site header, navigation links, and conditionally shows admin routes and the login button.",
  "frontend/src/components/status/StatusBadge.tsx": "Maps application status values to labeled UI badges with predefined variants.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdmin.ts": "Provides admin-focused queries and mutations for applications, processing fees, and receiving accounts.",
  "frontend/src/hooks/useApplications.ts": "Offers user-facing queries and mutations for creating applications and fetching status, fees, and payment instructions.",
  "frontend/src/hooks/useAuthz.ts": "Checks whether the current authenticated user is an admin, caching results to minimize revalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth provider and hook managing identity loading, login, logout, and status flags.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme CSS variables and base styles.",
  "frontend/src/main.tsx": "Initializes React app with React Query and InternetIdentityProvider and renders App.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Admin interface showing all applications and details, with ability to select and review individual applications.",
  "frontend/src/pages/admin/ReceivingAccounts.tsx": "Admin page for listing, creating, and editing payment receiving accounts.",
  "frontend/src/pages/Home.tsx": "Provides a grant application form with validation and submission flow, including displaying the submitted application ID.",
  "frontend/src/pages/NotAuthorized.tsx": "Renders an access‑denied message with a link back to the home page.",
  "frontend/src/pages/StatusTracker.tsx": "Lets users look up a grant application by ID and displays its status, details, and related fee info.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and clearing URL and sessionStorage parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom colors, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Project state metadata describing the SBA Grant Administration build, including features, issues, and architectural notes for the public site and admin dashboard."
}