{
  "backend/main.mo": "Implements access control, user profile management, and a full grant application system with create, read, and admin‑only update operations.",
  "feature_evidence.json": "Lists feature‑to‑file mappings with metadata, component dependencies, and confidence levels for implemented requirements.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of major frontend files including pages, components, hooks, and configuration.",
  "frontend/index.css": "Empty CSS file placeholder for global styles.",
  "frontend/index.html": "Defines the base HTML document that loads the React application root and main script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for public pages and admin‑protected sections using AppLayout and AdminGuard.",
  "frontend/src/components/admin/ApplicationDetail.tsx": "Displays full application details with admin actions for approving, rejecting, managing fees, and assigning receiving accounts.",
  "frontend/src/components/admin/ApplicationTable.tsx": "Renders a searchable table of applications and allows selecting an application for detailed admin review.",
  "frontend/src/components/admin/ReceivingAccountForm.tsx": "Form component for creating or editing a bank or crypto receiving account, parsing initial data and submitting formatted details.",
  "frontend/src/components/auth/AdminGuard.tsx": "Protects admin-only routes by checking identity and admin status, redirecting unauthorized users.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication and clearing cached queries.",
  "frontend/src/components/layout/AppLayout.tsx": "App layout wrapper including header, footer, and main content container.",
  "frontend/src/components/layout/SiteFooter.tsx": "Simple footer displaying copyright and a link to caffeine.ai.",
  "frontend/src/components/layout/SiteHeader.tsx": "Header with site branding, navigation links, and admin-only menu items based on identity and role.",
  "frontend/src/components/status/StatusBadge.tsx": "Displays a styled badge for an application’s status using predefined variants.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor based on identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAdmin.ts": "Admin-facing hooks for managing applications, fees, and receiving accounts via the backend actor.",
  "frontend/src/hooks/useApplications.ts": "Applicant-facing hooks to create applications and fetch status, fees, and payment instructions.",
  "frontend/src/hooks/useAuthz.ts": "Hook to check whether the current caller is an admin using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, logout, status, and stored identities.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme CSS variables and base styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Shows all applications for admins with selection and detail viewing.",
  "frontend/src/pages/admin/ReceivingAccounts.tsx": "Manages creation and editing of receiving accounts for payments.",
  "frontend/src/pages/Home.tsx": "Implements the grant application form with validation and submission flow.",
  "frontend/src/pages/NotAuthorized.tsx": "Displays an access-denied message with a link back to the home page.",
  "frontend/src/pages/StatusTracker.tsx": "Allows users to look up application status and related payment details by ID.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "JSON state file describing the project’s version, requirements, existing features, issues, and image assets for the SBA Grant Administration build."
}