{
  "kind": "build_request",
  "title": "Make the admin portal clearer and simplify “payment method” management labels",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-13",
      "text": "Update admin UI wording to match a simple “Admin Portal” concept: rename user-facing labels from “Receiving Accounts” to “Payment Methods” (or “Payment Accounts”) across admin navigation and pages, while keeping the existing /admin/accounts route unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Is it possible to have a simple its admin login Portal to handle  Fee for approve grant and Approve or reject and application Then I also get a space where I am to insert a payment method for them to pay their fees"
        ]
      },
      "acceptanceCriteria": [
        "In the admin header/navigation, the link currently labeled “Accounts” is relabeled to “Payment Methods” (or “Payment Accounts”) without changing its destination route (/admin/accounts).",
        "The /admin/accounts page title and description are updated to use the same “Payment Methods/Payment Accounts” wording (English).",
        "No public pages (/, /status) expose an “Admin Login” entry point beyond the existing behavior (login button only shown when already authenticated or on an /admin route)."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Add an obvious “Payment Methods” entry point inside the Admin Dashboard page so admins can quickly access where they insert/edit payment details for fees.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Then I also get a space where I am to insert a payment method for them to pay their fees"
        ]
      },
      "acceptanceCriteria": [
        "Admin Dashboard includes a clearly visible button/link labeled “Payment Methods” (or “Payment Accounts”) that navigates to /admin/accounts.",
        "The button/link is only visible/usable to authenticated admins (i.e., within the existing AdminGuard-protected area)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only UI component sources must be composed, not edited).",
    "Do not modify immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Adding real payment processing (card payments, Stripe, etc.).",
    "Adding third-party authentication providers; only Internet Identity is supported.",
    "Changing the existing routes (/admin and /admin/accounts) or altering backend data models for applications, fees, or receiving accounts."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}