{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Clarify admin portal wording and add Payment Methods shortcut",
  "requirements": [
    {
      "id": "REQ-13",
      "summary": "Rename admin-facing labels from “Receiving Accounts/Accounts” to “Payment Methods” while keeping /admin/accounts route unchanged and avoiding new public admin entry points.",
      "acceptanceCriteria": [
        "In the admin header/navigation, the link currently labeled “Accounts” is relabeled to “Payment Methods” (or “Payment Accounts”) without changing its destination route (/admin/accounts).",
        "The /admin/accounts page title and description are updated to use the same “Payment Methods/Payment Accounts” wording (English).",
        "No public pages (/, /status) expose an “Admin Login” entry point beyond the existing behavior (login button only shown when already authenticated or on an /admin route)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/SiteHeader.tsx",
          "operation": "modify",
          "description": "Update the admin navigation label for the existing /admin/accounts link from “Accounts” to “Payment Methods” (or “Payment Accounts”), keeping the route unchanged and preserving the existing conditional display behavior (no new public admin entry point). Uses existing shadcn-ui Button and TanStack Router Link composition—Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/ReceivingAccounts.tsx",
          "operation": "modify",
          "description": "Update page heading/description and key user-facing text strings to use “Payment Methods/Payment Accounts” wording (e.g., page title, empty state, dialog titles/descriptions, and action labels as appropriate) while keeping the page mounted at /admin/accounts. Uses existing shadcn-ui Card/Dialog/Button composition—Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/ApplicationDetail.tsx",
          "operation": "modify",
          "description": "Update any admin-visible references to “Receiving Account(s)” where they refer to the fee payment destination selection to instead say “Payment Method(s)/Payment Account(s)”, without changing underlying behavior. Uses existing composed UI components—Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Add a clear “Payment Methods” navigation action within the Admin Dashboard for quick access to /admin/accounts within the existing admin-guarded area.",
      "acceptanceCriteria": [
        "Admin Dashboard includes a clearly visible button/link labeled “Payment Methods” (or “Payment Accounts”) that navigates to /admin/accounts.",
        "The button/link is only visible/usable to authenticated admins (i.e., within the existing AdminGuard-protected area)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Add a prominent “Payment Methods/Payment Accounts” Button/Link on the Admin Dashboard that navigates to /admin/accounts. Keep this inside the existing AdminGuard-protected dashboard route (no public exposure). Uses TanStack Router Link and shadcn-ui Button/Card composition—Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}